/* Homework 7.
Реалізувати функцію фільтру масиву за вказаним типом даних.

Технічні вимоги:
Написати функцію filterBy(), яка прийматиме 2 аргументи.
Перший аргумент - масив, який міститиме будь-які дані, другий аргумент - тип даних.
Функція повинна повернути новий масив, який міститиме всі дані, які були передані в аргумент, за винятком тих, тип яких був переданий другим аргументом.
Тобто якщо передати масив ['hello', 'world', 23, '23', null], і другим аргументом передати 'string', то функція поверне масив [23, null].*/

let arr1 = [];              // Перший аргумент - масив, який міститиме будь-які дані,
let arr2 = [];              // другий аргумент - тип даних.

function filterBy(arr1, arr2) {
    // Функція повинна повернути новий масив
    // міститиме всі дані, які були передані в аргумент,
    // за винятком: тип яких був переданий другим аргументом
    let newArray = arr1.filter(item => (typeof item != arr2[0]));
    return newArray;
}

let result = filterBy(['hello', 'world', 23, '23', null], ['string']);
console.log(result);
